<?php
namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Helpers\helper;
use Faker\Factory as Faker;
use DB;

class AdsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $faker=Faker::create();

        DB::table('ads')->insert([
            'id'         =>1,
            'title'      => "مثال لنص يمكن أن يستبدل في نفس المساحة",
            'slug'       => "مثال-لنص-يمكن-أن-يستبدل-في-نفس-المساحة",
            'text'       => "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الف",
            'price'      => $faker->randomNumber(4),
            'user_id'    => rand(1, 5),
            'category_id'=> 5,
            'country_id' => rand(1, 6),
            'currency_id'=> rand(1, 6),
        ]);

        DB::table('ads')->insert([
            'id'         =>2,
            'title'      => "مثال لنص يمكن أن يستبدل في نفس المساحة",
            'slug'       => "1مثال-لنص-يمكن-أن-يستبدل-في-نفس-المساحة",
            'text'       => "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الف",
            'price'      => $faker->randomNumber(4),
            'user_id'    => rand(1, 5),
            'category_id'=> 5,
            'country_id' => rand(1, 6),
            'currency_id'=> rand(1, 6),
        ]);

        DB::table('ads')->insert([
            'id'         =>3,
            'title'      => "مثال لنص يمكن أن يستبدل في نفس المساحة",
            'slug'       => "2مثال-لنص-يمكن-أن-يستبدل-في-نفس-المساحة",
            'text'       => "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الف",
            'price'      => $faker->randomNumber(4),
            'user_id'    => rand(1, 5),
            'category_id'=> 5,
            'country_id' => rand(1, 6),
            'currency_id'=> rand(1, 6),
        ]);

        DB::table('ads')->insert([
            'id'         =>4,
            'title'      => "مثال لنص يمكن أن يستبدل في نفس المساحة",
            'slug'       => "3مثال-لنص-يمكن-أن-يستبدل-في-نفس-المساحة",
            'text'       => "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الف",
            'price'      => $faker->randomNumber(4),
            'user_id'    => rand(1, 5),
            'category_id'=> 5,
            'country_id' => rand(1, 6),
            'currency_id'=> rand(1, 6),
        ]);

        DB::table('ads')->insert([
            'id'         =>5,
            'title'      => "مثال لنص يمكن أن يستبدل في نفس المساحة",
            'slug'       => "4مثال-لنص-يمكن-أن-يستبدل-في-نفس-المساحة",
            'text'       => "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الف",
            'price'      => $faker->randomNumber(4),
            'user_id'    => rand(1, 5),
            'category_id'=> 5,
            'country_id' => rand(1, 6),
            'currency_id'=> rand(1, 6),
        ]);

        DB::table('ads')->insert([
            'id'         =>6,
            'title'      => "مثال لنص يمكن أن يستبدل في نفس المساحة",
            'slug'       => "5مثال-لنص-يمكن-أن-يستبدل-في-نفس-المساحة",
            'text'       => "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الف",
            'price'      => $faker->randomNumber(4),
            'user_id'    => rand(1, 5),
            'category_id'=> 3,
            'country_id' => rand(1, 6),
            'currency_id'=> rand(1, 6),
        ]);

        DB::table('ads')->insert([
            'id'         =>7,
            'title'      => "مثال لنص يمكن أن يستبدل في نفس المساحة",
            'slug'       => "6مثال-لنص-يمكن-أن-يستبدل-في-نفس-المساحة",
            'text'       => "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الف",
            'price'      => $faker->randomNumber(4),
            'user_id'    => rand(1, 5),
            'category_id'=> 3,
            'country_id' => rand(1, 6),
            'currency_id'=> rand(1, 6),
        ]);

        DB::table('ads')->insert([
            'id'         =>8,
            'title'      => "مثال لنص يمكن أن يستبدل في نفس المساحة",
            'slug'       => "7مثال-لنص-يمكن-أن-يستبدل-في-نفس-المساحة",
            'text'       => "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الف",
            'price'      => $faker->randomNumber(4),
            'user_id'    => rand(1, 5),
            'category_id'=> 3,
            'country_id' => rand(1, 6),
            'currency_id'=> rand(1, 6),
        ]);

        DB::table('ads')->insert([
            'id'         =>9,
            'title'      => "مثال لنص يمكن أن يستبدل في نفس المساحة",
            'slug'       => "8مثال-لنص-يمكن-أن-يستبدل-في-نفس-المساحة",
            'text'       => "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الف",
            'price'      => $faker->randomNumber(4),
            'user_id'    => rand(1, 5),
            'category_id'=> 4,
            'country_id' => rand(1, 6),
            'currency_id'=> rand(1, 6),
        ]);

        DB::table('ads')->insert([
            'id'         =>10,
            'title'      => "مثال لنص يمكن أن يستبدل في نفس المساحة",
            'slug'       => "9مثال-لنص-يمكن-أن-يستبدل-في-نفس-المساحة",
            'text'       => "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الف",
            'price'      => $faker->randomNumber(4),
            'user_id'    => rand(1, 5),
            'category_id'=> 4,
            'country_id' => rand(1, 6),
            'currency_id'=> rand(1, 6),
        ]);

        DB::table('ads')->insert([
            'id'         =>11,
            'title'      => "مثال لنص يمكن أن يستبدل في نفس المساحة",
            'slug'       => "00مثال-لنص-يمكن-أن-يستبدل-في-نفس-المساحة",
            'text'       => "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الف",
            'price'      => $faker->randomNumber(4),
            'user_id'    => rand(1, 5),
            'category_id'=> 4,
            'country_id' => rand(1, 6),
            'currency_id'=> rand(1, 6),
        ]);

        DB::table('ads')->insert([
            'id'         =>12,
            'title'      => "مثال لنص يمكن أن يستبدل في نفس المساحة",
            'slug'       => "11مثال-لنص-يمكن-أن-يستبدل-في-نفس-المساحة",
            'text'       => "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الف",
            'price'      => $faker->randomNumber(4),
            'user_id'    => rand(1, 5),
            'category_id'=> 4,
            'country_id' => rand(1, 6),
            'currency_id'=> rand(1, 6),
        ]);

        DB::table('ads')->insert([
            'id'         =>13,
            'title'      => "مثال لنص يمكن أن يستبدل في نفس المساحة",
            'slug'       => "12مثال-لنص-يمكن-أن-يستبدل-في-نفس-المساحة",
            'text'       => "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الف",
            'price'      => $faker->randomNumber(4),
            'user_id'    => rand(1, 5),
            'category_id'=> 4,
            'country_id' => rand(1, 6),
            'currency_id'=> rand(1, 6),
        ]);

        DB::table('ads')->insert([
            'id'         =>14,
            'title'      => "مثال لنص يمكن أن يستبدل في نفس المساحة",
            'slug'       => "13مثال-لنص-يمكن-أن-يستبدل-في-نفس-المساحة",
            'text'       => "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الف",
            'price'      => $faker->randomNumber(4),
            'user_id'    => rand(1, 5),
            'category_id'=> 1,
            'country_id' => rand(1, 6),
            'currency_id'=> rand(1, 6),
        ]);

        DB::table('ads')->insert([
            'id'         =>15,
            'title'      => "مثال لنص يمكن أن يستبدل في نفس المساحة",
            'slug'       => "14مثال-لنص-يمكن-أن-يستبدل-في-نفس-المساحة",
            'text'       => "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الف",
            'price'      => $faker->randomNumber(4),
            'user_id'    => rand(1, 5),
            'category_id'=> 1,
            'country_id' => rand(1, 6),
            'currency_id'=> rand(1, 6),
        ]);

        DB::table('ads')->insert([
            'id'         =>16,
            'title'      => "مثال لنص يمكن أن يستبدل في نفس المساحة",
            'slug'       => "15مثال-لنص-يمكن-أن-يستبدل-في-نفس-المساحة",
            'text'       => "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الف",
            'price'      => $faker->randomNumber(4),
            'user_id'    => rand(1, 5),
            'category_id'=> 7,
            'country_id' => rand(1, 6),
            'currency_id'=> rand(1, 6),
        ]);

        DB::table('ads')->insert([
            'id'         =>17,
            'title'      => "مثال لنص يمكن أن يستبدل في نفس المساحة",
            'slug'       => "16مثال-لنص-يمكن-أن-يستبدل-في-نفس-المساحة",
            'text'       => "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
            إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الف",
            'price'      => $faker->randomNumber(4),
            'user_id'    => rand(1, 5),
            'category_id'=> 7,
            'country_id' => rand(1, 6),
            'currency_id'=> rand(1, 6),
        ]);

    }
}
